app/controllers/rss_controller.rb

SELECT  "keywords".* FROM "keywords"  ORDER BY created_at DESC LIMIT 10000
---
  def index

    @keywords = Keyword.order("created_at DESC").limit(10000)